/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *   Mupen64plus-rsp-hle - audio.c                                         *
 *   Mupen64Plus homepage: http://code.google.com/p/mupen64plus/           *
 *   Copyright (C) 2012 Bobby Smiles                                       *
 *   Copyright (C) 2009 Richard Goedeken                                   *
 *   Copyright (C) 2002 Hacktarux                                          *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, write to the                         *
 *   Free Software Foundation, Inc.,                                       *
 *   51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.          *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

#include <assert.h>
#include <string.h>
#include "hle.h"

#include "adpcm.h"
#include "mp3.h"
#include "resample.h"

#define N_SEGMENTS 16

#define NAUDIO_SUBFRAME_SIZE 0x170  /* ie 184 samples */
#define NAUDIO_MAIN     0x4f0
#define NAUDIO_MAIN2    0x660
#define NAUDIO_DRY_LEFT     0x9d0
#define NAUDIO_DRY_RIGHT    0xb40
#define NAUDIO_WET_LEFT     0xcb0
#define NAUDIO_WET_RIGHT    0xe20

/* types defintions */
typedef void (*acmd_callback_t)(u32 w1, u32 w2);

/* local variables */
static struct audio_t
{
    // segments
    u32 segments[N_SEGMENTS]; // 0x320

    // main buffers
    u16 in;             // 0x0000(t8)
    u16 out;            // 0x0002(t8)
    u16 count;          // 0x0004(t8)

    // auxiliary buffers
    u16 aux_dry_right;  // 0x000a(t8)
    u16 aux_wet_left;   // 0x000c(t8)
    u16 aux_wet_right;  // 0x000e(t8)

    // envmixer gains
    s16 dry;            // 0x001c(t8)
    s16 wet;            // 0x001e(t8)

    // envmixer envelopes (0: left, 1: right)
    s16 env_vol[2];
    s16 env_target[2];
    s32 env_rate[2];

    // adpcm
    u32 adpcm_loop;     // 0x0010(t8)
    u16 adpcm_codebook[0x80];
} l_audio;

static struct naudio_t
{
    // envmixer gains
    s16 dry;
    s16 wet;

    // envmixer envelopes (0: left, 1: right)
    s16 env_vol[2];
    s16 env_target[2];
    s32 env_rate[2];

    // adpcm
    u32 adpcm_loop;
    u16 adpcm_codebook[0x80];
} l_naudio;

static struct audio_mk_t
{
    // segments
    u32 segments[N_SEGMENTS]; // 0x320

    // main buffers
    u16 in;             // 0x0000(t8)
    u16 out;            // 0x0002(t8)
    u16 count;          // 0x0004(t8)

    // adpcm
    u32 adpcm_loop;     // 0x0010(t8)
    u16 adpcm_codebook[0x80];

    //envmixer2 envelopes (0: dry left, 1: dry right, 2: wet)
    u16 env_value[3];
    u16 env_step[3];
} l_audio_mk;

static struct audio2_t
{
    // main buffers
    u16 in;             // 0x0000(t8)
    u16 out;            // 0x0002(t8)
    u16 count;          // 0x0004(t8)

    // adpcm
    u32 adpcm_loop;     // 0x0010(t8)
    u16 adpcm_codebook[0x80];

    //envmixer2 envelopes (0: dry left, 1: dry right, 2: wet)
    u16 env_value[3];
    u16 env_step[3];
} l_audio2;

struct ramp_t
{
    s32 value;
    s32 step;
    s32 target;
};

/* update ramp to its next value.
 * returns true if target has been reached, false otherwise */
static int ramp_next(struct ramp_t *ramp)
{
    ramp->value += ramp->step;

    return (ramp->step >= 0)
        ? (ramp->value > ramp->target)
        : (ramp->value < ramp->target);
}

static void envmix_exp_next_ramp(struct ramp_t *ramp, s32 *start, s32 *end, s32 rate)
{
    if (*start != ramp->target)
    {
        ramp->value = *start;
        ramp->step  = (*end - *start) >> 3;

        *start = (s32)(((s64)*start * (s64)rate) >> 16);
        *end   = (s32)(((s64)*end   * (s64)rate) >> 16);
    }
    else
    {
        ramp->value = ramp->target;
        ramp->step  = 0;
    }
}

/*
 * Audio flags
 */

#define A_INIT          0x01
